#include <reg51.h>
sbit P3_2=P3^2;
main(){
	unsigned char *P;   
	unsigned int a;
	P=0x40;			//指针指向片内40H单元
	TMOD =0x09;		//T0定时方式1，允许INT0启动计数器
	TH0 = TL0 = 0;	//装入计数初值
	do{} while(P3_2==1);//等待INT0变低
	TR0=1;			//启动计数器（允许INT1启动计数器）
	while(P3_2==0);	//等待脉冲上升沿，上升沿启动计数器
	while(P3_2==1);	//等待脉冲下降沿，下降沿停止计数器
	TR0 = 0;		//关闭T0，防止下一个上升沿启动计数器
	a = TH0*256+TL0;//将TH0和TL0中的数合成到整形变量a中
	for(a;a!=0;){	//循环，直到a为零
		*P=a%10;	//分解a,个位存放在40单元，其它以此递增
		a=a/10;		//删除最末位
		P++;		//存放地址加1
	}
	while(1){a=0;}	//原地等待(没有{}项不会影响运行，但无法设置断点)
 }


