/*********************************************************/
/*                    实例14                             */
/*********************************************************/
int i,j,row,colum,max;			//定义工作变量
int a[3][4]={{1,2,3,4},{9,8,7,6},{-10,10,-5,2}}; //定义数组并赋初值
main()
{	max=a[0][0];				//保存"擂主"值
	for (i=0;i<=2;i++) 			//扫描行元素
	{	for (j=0;j<=3;j++)		//扫描列元素
       		if (a[i][j]>max)	//比对当前"擂主"值
			{  	max=a[i][j];	//刷新当前"擂主"值
        		row=i;			//刷新"擂主"行下标
        		colum=j;		//刷新"擂主"列下标
			}		
     }
}




